<template>
  <div class="about-block">
    <h3 class="about-block__title">
      {{ title }}
    </h3>

    <p class="about-block__text">
      {{ text }}
    </p>

    <Accordion :data="accordion"/>
  </div>
</template>

<script>
import Accordion from '@/components/Accordion/Accordion.vue';

export default {
  name: 'AboutBlock',
  components: { Accordion },
  data() {
    return {
      title: 'О программе',
      text: 'Десять шагов к обретению баланса в мыслях, чувствах, эмоциях и теле.',
      accordion: {
        title: 'Инструкция и рекомендации',
        content: '<p>Инструкция</p>'
            + '<ul>'
            + '<li>Идейные соображения высшего порядка, а также укрепление и развитие структуры влечет</li>'
            + '<li>Внезапно, активно развивающиеся страны третьего мира неоднозначны и будут своевременно верифицированы.</li>'
            + '<li>Банальные, но неопровержимые выводы, а также акционеры крупнейших компаний призывают нас к новым свершениям</li>'
            + '<li>Вот вам яркий пример современных тенденций</li>'
            + '</ul>'
            + '<p>Рекомендации</p>'
            + '<ul>'
            + '<li>Значимость этих проблем настолько очевидна, что сложившаяся структура организации обеспечивает</li>'
            + '<li>Не следует, однако забывать, что постоянный количественный рост и сфера нашей активности</li>'
            + '<li>С другой стороны рамки и место обучения кадров требуют от нас анализа систем массового участия.</li>'
            + '<li>Идейные соображения высшего порядка</li>'
            + '</ul>',
      },
    };
  },
};
</script>

<style lang="scss" scoped>
@import "AboutBlock";
</style>
